---
kind: enumMember
id: F:Autodesk.Revit.UI.FaceBasedPlacementType.PlaceOnFace
enum: Autodesk.Revit.UI.FaceBasedPlacementType
source: html/2211f96d-49bf-1bdd-884b-9705d4d3b70b.htm
---
# Autodesk.Revit.UI.FaceBasedPlacementType.PlaceOnFace

Placement on a selected face from existing geometry.